import random
tries = 6
word_list = ['рік', 'людина', 'час', 'справа', 'життя', 'день', 'рука', 'раз', 'робота', 'слово', 'місце', 'обличчя', 
'друг', 'очі', 'питання', 'будинок', 'сторона', 'країна', 'світ', 'випадок', 'голова', 'дитина', 'сила', 'кінець', 'вид', 'система', 'частина', 'місто', 'ставлення', 'жінка', 'гроші', 'земля', 'машина', 'вода', 'батько','проблема', 'година', 'право', 'нога', 'рішення', 'двері', 'образ', 'історія', 'влада', 'закон', 'війна', 'бог', 'голос', 'тисяча', 'книга', 'можливість', 'результат', 'ніч', 'стіл', 'область', 'стаття', 'число', 'компанія', 'народ', 'дружина', 'група', 'розвиток', 'процес', 'суд', 'умова', 'засіб', 'початок', 'світло', 'пора', 'шлях', 'душа', 'рівень', 'форма', 'хвилина', 'вулиця', 'вечір', 'якість', 'ідея', 'дорога', 'мати', 'дія', 'місяць', 'держава', 'мова', 'любов', 'погляд', 'мама', 'століття', 'школа', 'ціль', 'суспільство', 'діяльність', 'організація', 'президент', 'кімната', 'порядок', 'момент', 'театр', 'лист', 'ранок', 'допомога', 'ситуація', 'роль', 'рубль', 'сенс', 'стан', 'квартира', 'орган', 'увага', 'тіло', 'праця', 'син', 'міра', 'ринок', 'програма', 'завдання', 'підприємство', 'вікно', 'розмова', 'уряд', 'виробництво', 'інформація', 'становище', 'центр', 'відповідь', 'чоловік', 'автор', 'стіна', 'інтерес', 'правило', 'управління', 'чоловік', 'ідея', 'партія', 'рада', 'рахунок', 'серце', 'рух', 'річ', 'матеріал', 'тиждень', 'почуття', 'глава', 'наука', 'ряд', 'газета', 'причина', 'плече', 'ціна', 'план', 'мова', 'точка', 'основа', 'товариш', 'культура', 'дані', 'думка', 'документ', 'інститут', 'хід', 'проект', 'зустріч', 'директор', 'термін', 'палець', 'досвід', 'служба', 'доля', 'дівчина', 'черга', 'ліс', 'склад', 'кількість', 'подія', 'зал', 'створення', 'значення', 'період', 'крок', 'брат', 'мистецтво', 'структура', 'номер', 'приклад', 'дослідження', 'громадянин', 'гра', 'начальник', 'зріст', 'тема', 'принцип', 'метод', 'тип', 'фільм', 'край', 'гість', 'повітря', 'характер', 'боротьба', 'використання', 'розмір', 'освіта', 'хлопчик', 'кров', 'район', 'небо', 'армія', 'клас', 'представник', 'участь', 'дівчинка', 'політика', 'герой', 'картина', 'долар', 'спина', 'територія', 'підлога', 'поле', 'зміна', 'напрямок', 'малюнок', 'церква', 'банк', 'сцена', 'населення', 'більшість', 'музика', 'правда', 'свобода', 'команда', 'союз', 'лікар', 'договір', 'дерево', 'факт', 'господар', 'природа', 'кут', 'телефон', 'позиція', 'двір', 'письменник', 'літак', 'рід', 'сонце', 'віра', 'берег', 'вистава', 'фірма', 'спосіб', 'завод', 'колір', 'журнал', 'керівник', 'фахівець', 'оцінка', 'регіон', 'пісня', 'процент', 'батько', 'море', 'вимоги', 'основи', 'половина', 'роман', 'коло', 'аналіз', 'вірші', 'автомобіль', 'економіка', 'література', 'папір', 'поет', 'ступінь', 'пан', 'надія', 'предмет', 'варіант', 'міністр', 'кордон', 'дух', 'модель', 'операція', 'пара', 'сон', 'назва', 'розум', 'привид', 'старий', 'мільйон', 'успіх', 'щастя', 'хлопці', 'кабінет', 'магазин', 'простір', 'вихід', 'удар', 'база', 'знання', 'текст', 'захист', 'керівництво', 'площа', 'свідомість', 'вік', 'учасник', 'ділянка', 'пункт', 'лінія', 'бажання', 'тато', 'лікар', 'губа', 'дочка', 'середа', 'голова', 'солдат', 'художник', 'волос', 'зброя', 'відповідність', 'вітер', 'хлопець', 'зір', 'генерал', 'вогонь', 'поняття', 'будівництво', 'вухо', 'ніс', 'страх', 'послуга', 'зміст', 'радість', 'безпека', 'продукт', 'комплекс', 'бізнес', 'сад', 'співробітник', 'літо', 'курс', 'пропозиція', 'рот', 'технологія', 'реформа', 'відсутність', 'собака', 'камінь', 'майбутнє', 'оповідання', 'контроль', 'річка', 'продукція', 'сума', 'техніка', 'будівля', 'сфера', 'необхідність', 'фонд', 'підготовка', 'лист', 'республіка', 'господарство', 'воля', 'бюджет', 'сніг', 'село', 'мужик', 'елемент', 'обставина', 'німець', 'перемога', 'джерело', 'зірка', 'вибір', 'маса', 'підсумок', 'сестра', 'практика', 'проведення', 'кишеня', 'слава', 'кухня', 'визначення', 'функція', 'військо', 'комісія', 'застосування', 'капітан', 'працівник', 'забезпечення', 'офіцер', 'прізвище', 'межа', 'вибори', 'вчений', 'пляшка', 'бій', 'теорія', 'відділ', 'зуб', 'розробка', 'особа', 'гора', 'товар', 'метр', 'свято', 'вплив', 'читач', 
'задоволення', 'актор', 'сльоза', 'відповідальність', 'учитель', 'акт', 'біль', 'множина', 'особливість', 'показник']
def display_hangman(tries):
  stages = [ # фінальний стан: голова, торс, обидві руки, обидві ноги
        '''
          --------
          |   |
          |   O
          |  \\|/
          |   |
          |  / \\
          -
        ''',
        # голова, торс, обидві руки, одна нога
        '''
          --------
          |   |
          |   O
          |  \\|/
          |   |
          |  / 
          -
        ''',
        # голова, торс, обидві руки
        '''
          --------
          |   |
          |   O
          |  \\|/
          |   |
          |    
          -
        ''',
        # голова, торс та одна рука
        '''
          --------
          |   |
          |   O
          |  \\|
          |   |
          |   
          -
        ''',
        # голова та торс
        '''
          --------
          |   |
          |   O
          |   |
          |   |
          |   
          -
        ''',
        # голова
        '''
          --------
          |   |
          |   O
          |   
          |    
          |   
          -
        ''',
        # початковий стан
        '''
          --------
          |   |
          |    
          |   
          |    
          |   
          -
        '''
  ]
  return stages[tries]
print('Слово загаданно!')
x = random.choice(word_list)
x = list(x)
coli = len(x)
xx = '*' * coli
xx = list(xx)
a = 0
def game():
    print(x)
    otvet = input('Літера: ')
    if otvet in x:
        print('Так така буква є')
        if_have = x.index(otvet)
        print(if_have)
        del xx[if_have]
        xx.insert(if_have, otvet)
        print(*xx)
        game()
    elif otvet not in x:
            print('Не вгадали!')
            tries -= 1
            print(display_hangman(tries))
            game()
game()