import random
from secrets import choice
answers = ['Безперечно', 'Мені здається - так', 'Поки незрозуміло, спробуй знову', 'Навіть не думай', 'Вирішено', 'Найімовірніше', 'Запитай пізніше', 'Моя відповідь - ні', ' Жодних сумнівів', 'Гарні перспективи', 'Краще не розповідати', 'За моїми даними - ні', 'Певно так', 'Знаки кажуть - так', 'Зараз не можна передбачити', 'Перспективи не дуже хороші', 'Можеш бути впевнений у цьому', 'Так', 'Сконцентруйся і запитай знову', 'Дуже сумнівно']
print('Я магічна куля, запитай у мене щось')
get_ansver = input()
rand = choice(answers)
print(rand)